app/controllers/purchases_controller.rb

SELECT "purchases".* FROM "purchases" WHERE (date_received is NOT NULL) ORDER BY starred asc, date_requested DESC, id desc LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "purchases" WHERE (date_received is NOT NULL)
---
  def index
    page = params[:purPage] || 1
    sort = params[:sort] || 'dateRequested'
    direction = params[:direction] || 'DESC'
    tab = params[:tab] || 'Purchased'
    buyer = params[:filterBuyer] || ((current_user.buyer?) ? current_user.id : 'all')
    buyer = 'all' if tab == 'New'
    purchase_type = params[:purType]

    purchases = Purchase.eager_min.
                         pur_type(purchase_type).
                         tab(tab).
                         buyer(buyer).
                         sorted(sort, direction).
                         page(page).
                         per(Settings.app.pagination.per_page)

    render json: purchases,
           meta:  { per_page:  Settings.app.pagination.per_page,
                    total_count: purchases.total_count,
                    found_count: purchases.length,
                    page: page,
                    tab: tab,
                    sort: sort,
                    direction: direction

SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = $1 LIMIT 1  [["id", "60"]]
SELECT "receivings".* FROM "receivings" WHERE "receivings"."purchase_id" IN (60)
---
  def receive_all
    @purchase = Purchase.eager_receiving.find(params[:id])

SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = $1 LIMIT 1  [["id", "87"]]
---
  def set_record
    @id = params[:id]
    @purchase = Purchase.eager_all.find(@id)